ScriptGenModelNLayerDropout(
  (encoder): Embedding(128, 512)
  (lstm): LSTM(512, 512, num_layers=2, batch_first=True, dropout=0.5)
  (decoder): Linear(in_features=512, out_features=128, bias=True)
)
seq length: 100, batch_size: 64, feat_size: 512, test_batch_size: 256, lr: 0.0025, decay: 0.0005
nova_ALL_transcripts
